Revit 2027 API
ParameterTypeId.FamilyNestingBehavior Property
 "Family Nesting Behavior"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FamilyNestingBehavior { get; }
Public Shared ReadOnly Property FamilyNestingBehavior As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FamilyNestingBehavior {
	ForgeTypeId^ get ();
}
static member FamilyNestingBehavior : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace